v2006/overPimpleDyMFoam_double/background/0/zoneID_orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{


    "(overset|overset_moving_object2)"
    {
        type            overset;
	value		$internalField;
    }

    "(maxX|minX|maxY|minY|maxZ|minZ|wall)"
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
